micropython/micropython/cc3200/mods/pybpin.c
/// \method print()
/// Return a string describing the pin object.
STATIC void pin_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    pin_obj_t *self = self_in;
    uint32_t af = MAP_PinModeGet(self->pin_num);
    uint32_t type = pin_get_type(self);
    uint32_t strength = pin_get_strenght(self);

    // pin name
    mp_printf(print, "<Pin.cpu.%q, af=%u", self->name, af);

    if (af == PIN_MODE_0) {
        // IO mode
        qstr mode_qst;
        uint32_t mode = pin_get_mode(self);
        if (mode == GPIO_DIR_MODE_IN) {
            mode_qst = MP_QSTR_IN;
        } else {
            mode_qst = MP_QSTR_OUT;
        }
        mp_printf(print, ", mode=Pin.%q", mode_qst);
    }

    // pin type
    qstr type_qst;
    if (type == PIN_TYPE_STD) {
        type_qst = MP_QSTR_STD;
    } else if (type == PIN_TYPE_STD_PU) {
        type_qst = MP_QSTR_STD_PU;
    } else if (type == PIN_TYPE_STD_PD) {
        type_qst = MP_QSTR_STD_PD;
    } else if (type == PIN_TYPE_OD) {
        type_qst = MP_QSTR_OD;
    } else if (type == PIN_TYPE_OD_PU) {
        type_qst = MP_QSTR_OD_PU;
    } else {
        type_qst = MP_QSTR_OD_PD;
    }
    mp_printf(print, ", pull=Pin.%q", type_qst);

    // Strength
    qstr str_qst;
    if (strength == PIN_STRENGTH_2MA) {
        str_qst = MP_QSTR_S2MA;
    } else if (strength == PIN_STRENGTH_4MA) {
        str_qst = MP_QSTR_S4MA;
    } else {
        str_qst = MP_QSTR_S6MA;
    }
    mp_printf(print, ", strength=Pin.%q>", str_qst);
}

/// \classmethod \constructor(id, ...)
/// Create a new Pin object associated with the id.  If additional arguments are given,
/// they are used to initialise the pin.  See `init`.
STATIC mp_obj_t pin_make_new(mp_obj_t self_in, mp_uint_t n_args, mp_uint_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);

    // Run an argument through the mapper and return the result.
    pin_obj_t *pin = (pin_obj_t *)pin_find(args[0]);

    if (n_args > 1 || n_kw > 0) {
        // pin af given, so configure it
        mp_map_t kw_args;
        mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
        pin_obj_init_helper(pin, n_args - 1, args + 1, &kw_args);
    }

    return (mp_obj_t)pin;
}

STATIC mp_obj_t pin_obj_init(mp_uint_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    return pin_obj_init_helper(args[0], n_args - 1, args + 1, kw_args);
}
MP_DEFINE_CONST_FUN_OBJ_KW(pin_init_obj, 1, pin_obj_init);

/// \method value([value])
/// Get or set the digital logic level of the pin:
///
///   - With no arguments, return 0 or 1 depending on the logic level of the pin.
///   - With `value` given, set the logic level of the pin.  `value` can be
///   anything that converts to a boolean.  If it converts to `True`, the pin
///   is set high, otherwise it is set low.
STATIC mp_obj_t pin_value(mp_uint_t n_args, const mp_obj_t *args) {
    pin_obj_t *self = args[0];
    if (n_args == 1) {
        // get the pin value
        return MP_OBJ_NEW_SMALL_INT(MAP_GPIOPinRead(self->port, self->bit) ? 1 : 0);
    } else {
        // set the pin value
        if (mp_obj_is_true(args[1])) {
            MAP_GPIOPinWrite(self->port, self->bit, self->bit);
        } else {
            MAP_GPIOPinWrite(self->port, self->bit, 0);
        }
        return mp_const_none;
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(pin_value_obj, 1, 2, pin_value);

/// \method low()
/// Set the pin to a low logic level.
STATIC mp_obj_t pin_low(mp_obj_t self_in) {
    pin_obj_t *self = self_in;
    MAP_GPIOPinWrite(self->port, self->bit, 0);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pin_low_obj, pin_low);

/// \method high()
/// Set the pin to a high logic level.
STATIC mp_obj_t pin_high(mp_obj_t self_in) {
    pin_obj_t *self = self_in;
    MAP_GPIOPinWrite(self->port, self->bit, self->bit);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pin_high_obj, pin_high);

/// \method toggle()
/// Toggles the value of the pin
STATIC mp_obj_t pin_toggle(mp_obj_t self_in) {
    pin_obj_t *self = self_in;
    MAP_GPIOPinWrite(self->port, self->bit, ~MAP_GPIOPinRead(self->port, self->bit));
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pin_toggle_obj, pin_toggle);

/// \method name()
/// Get the pin name.
STATIC mp_obj_t pin_name(mp_obj_t self_in) {
    pin_obj_t *self = self_in;
    return MP_OBJ_NEW_QSTR(self->name);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pin_name_obj, pin_name);

/// \method port()
/// Get the pin port.
STATIC mp_obj_t pin_port(mp_obj_t self_in) {
    pin_obj_t *self = self_in;
    return mp_obj_new_int(self->port);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pin_port_obj, pin_port);

/// \method pin()
/// Get the pin number.
STATIC mp_obj_t pin_pin(mp_obj_t self_in) {
    pin_obj_t *self = self_in;
    return MP_OBJ_NEW_SMALL_INT(self->pin_num);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pin_pin_obj, pin_pin);

/// \method mode()
/// Returns the currently configured mode of the gpio pin. The integer returned
/// will match one of the allowed constants for the mode argument to the init
/// function.
STATIC mp_obj_t pin_mode(mp_obj_t self_in) {
    return MP_OBJ_NEW_SMALL_INT(pin_get_mode(self_in));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pin_mode_obj, pin_mode);

/// \method type()
/// Returns the currently configured type of the pin. The integer returned
/// will match one of the allowed constants for the type argument to the init
/// function.
STATIC mp_obj_t pin_type_get(mp_obj_t self_in) {
    return MP_OBJ_NEW_SMALL_INT(pin_get_type(self_in));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pin_type_obj, pin_type_get);

/// \method strength()
/// Returns the currently configured drive strength of the pin. The integer returned
/// will match one of the allowed constants for the strength argument to the init
/// function.
STATIC mp_obj_t pin_strength(mp_obj_t self_in) {
    return MP_OBJ_NEW_SMALL_INT(pin_get_strenght(self_in));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pin_strenght_obj, pin_strength);

/// \method af()
/// Returns the currently configured alternate function of the gpio pin. The integer returned
/// will match one of the allowed constants for the af argument to the init function.
STATIC mp_obj_t pin_af(mp_obj_t self_in) {
    pin_obj_t *self = self_in;
    return MP_OBJ_NEW_SMALL_INT(MAP_PinModeGet(self->pin_num));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(pin_af_obj, pin_af);

/// \method callback(method, intmode, priority, pwrmode)
/// Creates a callback object associated to a pin
/// min num of arguments is 1 (intmode)
STATIC mp_obj_t pin_callback (mp_uint_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    mp_arg_val_t args[mpcallback_INIT_NUM_ARGS];
    mp_arg_parse_all(n_args - 1, pos_args + 1, kw_args, mpcallback_INIT_NUM_ARGS, mpcallback_init_args, args);

    pin_obj_t *self = pos_args[0];
    // check if any parameters were passed
    mp_obj_t _callback = mpcallback_find(self);
    if (kw_args->used > 0 || !_callback) {
        // convert the priority to the correct value
        uint priority = mpcallback_translate_priority (args[2].u_int);
        // verify the interrupt mode
        uint intmode = args[0].u_int;
        if (intmode != GPIO_FALLING_EDGE && intmode != GPIO_RISING_EDGE && intmode != GPIO_BOTH_EDGES &&
            intmode != GPIO_LOW_LEVEL && intmode != GPIO_HIGH_LEVEL) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, mpexception_value_invalid_arguments));
        }

        uint pwrmode = args[4].u_int;
        if (pwrmode > (PYB_PWR_MODE_ACTIVE | PYB_PWR_MODE_LPDS | PYB_PWR_MODE_HIBERNATE)) {
            goto invalid_args;
        }

        // get the wake info from this pin
        uint hib_pin, idx;
        pin_get_hibernate_pin_and_idx ((const pin_obj_t *)self, &hib_pin, &idx);
        if (pwrmode & PYB_PWR_MODE_LPDS) {
            if (idx >= PYBPIN_NUM_WAKE_PINS) {
                goto invalid_args;
            }
            // wake modes are different in LDPS
            uint wake_mode;
            switch (intmode) {
            case GPIO_FALLING_EDGE:
                wake_mode = PRCM_LPDS_FALL_EDGE;
                break;
            case GPIO_RISING_EDGE:
                wake_mode = PRCM_LPDS_RISE_EDGE;
                break;
            case GPIO_LOW_LEVEL:
                wake_mode = PRCM_LPDS_LOW_LEVEL;
                break;
            case GPIO_HIGH_LEVEL:
                wake_mode = PRCM_LPDS_HIGH_LEVEL;
                break;
            default:
                goto invalid_args;
                break;
            }

            // first clear the lpds value from all wake-able pins
            for (uint i = 0; i < PYBPIN_NUM_WAKE_PINS; i++) {
                pybpin_wake_pin[i].lpds = PYBPIN_WAKES_NOT;
            }

            // enable this pin as a wake-up source during LPDS
            pybpin_wake_pin[idx].lpds = wake_mode;
        }
        else {
            // this pin was the previous LPDS wake source, so disable it completely
            if (pybpin_wake_pin[idx].lpds != PYBPIN_WAKES_NOT) {
                MAP_PRCMLPDSWakeupSourceDisable(PRCM_LPDS_GPIO);
            }
            pybpin_wake_pin[idx].lpds = PYBPIN_WAKES_NOT;
        }

        if (pwrmode & PYB_PWR_MODE_HIBERNATE) {
            if (idx >= PYBPIN_NUM_WAKE_PINS) {
                goto invalid_args;
            }
            // wake modes are different in hibernate
            uint wake_mode;
            switch (intmode) {
            case GPIO_FALLING_EDGE:
                wake_mode = PRCM_HIB_FALL_EDGE;
                break;
            case GPIO_RISING_EDGE:
                wake_mode = PRCM_HIB_RISE_EDGE;
                break;
            case GPIO_LOW_LEVEL:
                wake_mode = PRCM_HIB_LOW_LEVEL;
                break;
            case GPIO_HIGH_LEVEL:
                wake_mode = PRCM_HIB_HIGH_LEVEL;
                break;
            default:
                goto invalid_args;
                break;
            }

            // enable this pin as wake-up source during hibernate
            pybpin_wake_pin[idx].hib = wake_mode;
        }
        else {
            pybpin_wake_pin[idx].hib = PYBPIN_WAKES_NOT;
        }

        // we need to update the callback atomically, so we disable the
        // interrupt before we update anything.
        pin_extint_disable(self);
        if (pwrmode & PYB_PWR_MODE_ACTIVE) {
            // register the interrupt
            pin_extint_register((pin_obj_t *)self, intmode, priority);
            if (idx < PYBPIN_NUM_WAKE_PINS) {
                pybpin_wake_pin[idx].active = true;
            }
        }
        else if (idx < PYBPIN_NUM_WAKE_PINS) {
            pybpin_wake_pin[idx].active = false;
        }

        // all checks have passed, now we can create the callback
        _callback = mpcallback_new (self, args[1].u_obj, &pin_cb_methods);
        if (pwrmode & PYB_PWR_MODE_LPDS) {
            pybsleep_set_gpio_lpds_callback (_callback);
        }

        // enable the interrupt just before leaving
        pin_extint_enable(self);
    }
    return _callback;

